RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Source/Templates/gcc/startup_stm32h7r3xx.s
/*******************************************************************************
*
* Provide weak aliases for each Exception handler to the Default_Handler.
* As they are weak aliases, any function with the same name will override
* this definition.
*
*******************************************************************************/

   .weak      NMI_Handler
   .thumb_set NMI_Handler,Default_Handler

   .weak      HardFault_Handler
   .thumb_set HardFault_Handler,Default_Handler

   .weak      MemManage_Handler
   .thumb_set MemManage_Handler,Default_Handler

   .weak      BusFault_Handler
   .thumb_set BusFault_Handler,Default_Handler

   .weak      UsageFault_Handler
   .thumb_set UsageFault_Handler,Default_Handler

   .weak      SVC_Handler
   .thumb_set SVC_Handler,Default_Handler

   .weak      DebugMon_Handler
   .thumb_set DebugMon_Handler,Default_Handler

   .weak      PendSV_Handler
   .thumb_set PendSV_Handler,Default_Handler

   .weak      SysTick_Handler
   .thumb_set SysTick_Handler,Default_Handler

   .weak      PVD_PVM_IRQHandler
   .thumb_set PVD_PVM_IRQHandler,Default_Handler

   .weak      DTS_IRQHandler
   .thumb_set DTS_IRQHandler,Default_Handler

   .weak      IWDG_IRQHandler
   .thumb_set IWDG_IRQHandler,Default_Handler

   .weak      WWDG_IRQHandler
   .thumb_set WWDG_IRQHandler,Default_Handler

   .weak      RCC_IRQHandler
   .thumb_set RCC_IRQHandler,Default_Handler

   .weak      FLASH_IRQHandler
   .thumb_set FLASH_IRQHandler,Default_Handler

   .weak      RAMECC_IRQHandler
   .thumb_set RAMECC_IRQHandler,Default_Handler

   .weak      FPU_IRQHandler
   .thumb_set FPU_IRQHandler,Default_Handler

   .weak      TAMP_IRQHandler
   .thumb_set TAMP_IRQHandler,Default_Handler

   .weak      EXTI0_IRQHandler
   .thumb_set EXTI0_IRQHandler,Default_Handler

   .weak      EXTI1_IRQHandler
   .thumb_set EXTI1_IRQHandler,Default_Handler

   .weak      EXTI2_IRQHandler
   .thumb_set EXTI2_IRQHandler,Default_Handler

   .weak      EXTI3_IRQHandler
   .thumb_set EXTI3_IRQHandler,Default_Handler

   .weak      EXTI4_IRQHandler
   .thumb_set EXTI4_IRQHandler,Default_Handler

   .weak      EXTI5_IRQHandler
   .thumb_set EXTI5_IRQHandler,Default_Handler

   .weak      EXTI6_IRQHandler
   .thumb_set EXTI6_IRQHandler,Default_Handler

   .weak      EXTI7_IRQHandler
   .thumb_set EXTI7_IRQHandler,Default_Handler

   .weak      EXTI8_IRQHandler
   .thumb_set EXTI8_IRQHandler,Default_Handler

   .weak      EXTI9_IRQHandler
   .thumb_set EXTI9_IRQHandler,Default_Handler

   .weak      EXTI10_IRQHandler
   .thumb_set EXTI10_IRQHandler,Default_Handler

   .weak      EXTI11_IRQHandler
   .thumb_set EXTI11_IRQHandler,Default_Handler

   .weak      EXTI12_IRQHandler
   .thumb_set EXTI12_IRQHandler,Default_Handler

   .weak      EXTI13_IRQHandler
   .thumb_set EXTI13_IRQHandler,Default_Handler

   .weak      EXTI14_IRQHandler
   .thumb_set EXTI14_IRQHandler,Default_Handler

   .weak      EXTI15_IRQHandler
   .thumb_set EXTI15_IRQHandler,Default_Handler

   .weak      RTC_IRQHandler
   .thumb_set RTC_IRQHandler,Default_Handler

   .weak      PKA_IRQHandler
   .thumb_set PKA_IRQHandler,Default_Handler

   .weak      HASH_IRQHandler
   .thumb_set HASH_IRQHandler,Default_Handler

   .weak      RNG_IRQHandler
   .thumb_set RNG_IRQHandler,Default_Handler

   .weak      ADC1_2_IRQHandler
   .thumb_set ADC1_2_IRQHandler,Default_Handler

   .weak      GPDMA1_Channel0_IRQHandler
   .thumb_set GPDMA1_Channel0_IRQHandler,Default_Handler

   .weak      GPDMA1_Channel1_IRQHandler
   .thumb_set GPDMA1_Channel1_IRQHandler,Default_Handler

   .weak      GPDMA1_Channel2_IRQHandler
   .thumb_set GPDMA1_Channel2_IRQHandler,Default_Handler

   .weak      GPDMA1_Channel3_IRQHandler
   .thumb_set GPDMA1_Channel3_IRQHandler,Default_Handler

   .weak      GPDMA1_Channel4_IRQHandler
   .thumb_set GPDMA1_Channel4_IRQHandler,Default_Handler

   .weak      GPDMA1_Channel5_IRQHandler
   .thumb_set GPDMA1_Channel5_IRQHandler,Default_Handler

   .weak      GPDMA1_Channel6_IRQHandler
   .thumb_set GPDMA1_Channel6_IRQHandler,Default_Handler

   .weak      GPDMA1_Channel7_IRQHandler
   .thumb_set GPDMA1_Channel7_IRQHandler,Default_Handler

   .weak      TIM1_BRK_IRQHandler
   .thumb_set TIM1_BRK_IRQHandler,Default_Handler

   .weak      TIM1_UP_IRQHandler
   .thumb_set TIM1_UP_IRQHandler,Default_Handler

   .weak      TIM1_TRG_COM_IRQHandler
   .thumb_set TIM1_TRG_COM_IRQHandler,Default_Handler

   .weak      TIM1_CC_IRQHandler
   .thumb_set TIM1_CC_IRQHandler,Default_Handler

   .weak      TIM2_IRQHandler
   .thumb_set TIM2_IRQHandler,Default_Handler

   .weak      TIM3_IRQHandler
   .thumb_set TIM3_IRQHandler,Default_Handler

   .weak      TIM4_IRQHandler
   .thumb_set TIM4_IRQHandler,Default_Handler

   .weak      TIM5_IRQHandler
   .thumb_set TIM5_IRQHandler,Default_Handler

   .weak      TIM6_IRQHandler
   .thumb_set TIM6_IRQHandler,Default_Handler

   .weak      TIM7_IRQHandler
   .thumb_set TIM7_IRQHandler,Default_Handler

   .weak      TIM9_IRQHandler
   .thumb_set TIM9_IRQHandler,Default_Handler

   .weak      SPI1_IRQHandler
   .thumb_set SPI1_IRQHandler,Default_Handler

   .weak      SPI2_IRQHandler
   .thumb_set SPI2_IRQHandler,Default_Handler

   .weak      SPI3_IRQHandler
   .thumb_set SPI3_IRQHandler,Default_Handler

   .weak      SPI4_IRQHandler
   .thumb_set SPI4_IRQHandler,Default_Handler

   .weak      SPI5_IRQHandler
   .thumb_set SPI5_IRQHandler,Default_Handler

   .weak      SPI6_IRQHandler
   .thumb_set SPI6_IRQHandler,Default_Handler

   .weak      HPDMA1_Channel0_IRQHandler
   .thumb_set HPDMA1_Channel0_IRQHandler,Default_Handler

   .weak      HPDMA1_Channel1_IRQHandler
   .thumb_set HPDMA1_Channel1_IRQHandler,Default_Handler

   .weak      HPDMA1_Channel2_IRQHandler
   .thumb_set HPDMA1_Channel2_IRQHandler,Default_Handler

   .weak      HPDMA1_Channel3_IRQHandler
   .thumb_set HPDMA1_Channel3_IRQHandler,Default_Handler

   .weak      HPDMA1_Channel4_IRQHandler
   .thumb_set HPDMA1_Channel4_IRQHandler,Default_Handler

   .weak      HPDMA1_Channel5_IRQHandler
   .thumb_set HPDMA1_Channel5_IRQHandler,Default_Handler

   .weak      HPDMA1_Channel6_IRQHandler
   .thumb_set HPDMA1_Channel6_IRQHandler,Default_Handler

   .weak      HPDMA1_Channel7_IRQHandler
   .thumb_set HPDMA1_Channel7_IRQHandler,Default_Handler

